jonacappelle/nRF52-DCU/main.c
typedef enum
{
    CMD_TYPE,
    CMD_FREQ,
} cmd_received_t;



#define CMD_GYRO    0x67 //g
#define CMD_ACCEL   0x61 //a
#define CMD_MAG     0x6D //m

#define CMD_QUAT    0x71 //q
#define CMD_QUAT6   0x36 //6
#define CMD_QUAT9   0x39 //9

#define CMD_EULER   0x65 //e

#define CMD_CR      0x0A //carriage return

#define CMD_FREQ    0x66 //f

#define CMD_FREQ_LEN    3 // Length of the frequency component of uart config
#define CMD_FREQ_50     50
#define CMD_FREQ_100    100
#define CMD_FREQ_225    225

#define CMD_PRINT       0x68 //h
#define CMD_SETTINGS    0x70 //p
#define CMD_RESET       0x72 //r
#define CMD_SEND        0x73 //s

void uart_print(char msg[])
{
    uint32_t err_code;

    do
    {
        err_code = nrf_drv_uart_tx(&imu.uart, (uint8_t *) msg, (uint8_t)strlen(msg));
        if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
        {
            APP_ERROR_CHECK(err_code);
        }
    } while (err_code == NRF_ERROR_BUSY);
    // nrf_delay_ms(10);
}

uint8_t uart_rx_to_cmd(uint8_t * command_in, uint8_t len)
{
    uint8_t temp[len];
    memcpy(temp, command_in, len);

    NRF_LOG_INFO("%d %d %d", command_in[0], command_in[1], command_in[2]);
    NRF_LOG_FLUSH();

    uint8_t x =  atoi(temp);

    NRF_LOG_INFO("%d", x);
    NRF_LOG_FLUSH();

    return x;
}

void uart_rx_scheduled(void *p_event_data, uint16_t event_size)
{
    uint8_t state = CMD_TYPE;

    ret_code_t err_code;

    uint8_t p_byte[3];

    // If there is data left in FIFO and the read byte is not a carriage return
    while((app_fifo_get(&buffer.uart_rx_fifo, p_byte) != NRF_ERROR_NOT_FOUND))
    {    
            // Check if end of message is reached
            if(p_byte[0] == CMD_CR) 
            {   
                NRF_LOG_INFO("Break!");
                // NRF_LOG_FLUSH();
                break;
            }
            // Here we can process the request received over UART

            NRF_LOG_INFO("p_byte: %d", p_byte[0]);
            // NRF_LOG_FLUSH();

            switch(p_byte[0])
            {
                case CMD_PRINT:
                        NRF_LOG_INFO("CMD_PRINT received");

                        uart_print("------------------------------------------\n");
                        uart_print("-----  NOMADE WIRELESS SENSOR NODE   -----\n");
                        uart_print("------------------------------------------\n");
                        uart_print("\n");
                        uart_print("Press:  'h' for help\n");
                        uart_print("Press:  's' to show current settings\n");
                        uart_print("Press:  'g' to enable gyroscope\n");
                        uart_print("Press:  'a' to enable accelerometer\n");
                        uart_print("Press:  'm' to enable magnetometer\n");
                        uart_print("Press:  'e' to enable euler angles\n");
                        uart_print("Press:  'q6 to enable 6 DoF quaternions\n");
                        uart_print("Press:  'q9 to enable 9 DoF quaternions\n");
                        uart_print("------------------------------------------\n");
                        uart_print("Press:  'f' + '3 digital number' to set sampling frequency\n");
                        uart_print("------------------------------------------\n");
                        uart_print("Example:    q6f225  Enable 6 DoF Quaternions with sampling rate of 225 Hz\n");
                        uart_print("------------------------------------------\n");
                    break;

                case CMD_SETTINGS:
                        NRF_LOG_INFO("CMD_SETTINGS received");

                        uart_print("------------------------------------------\n");
                        uart_print("Current settings:\n");
                        if(imu.gyro_enabled) uart_print("---    Gyroscope enabled\n");
                        if(imu.accel_enabled) uart_print("---   Accelerometer enabled\n");
                        if(imu.mag_enabled) uart_print("--- Magnetometer enabled\n");
                        if(imu.euler_enabled) uart_print("---   Euler angles enabled\n");
                        if(imu.quat6_enabled) uart_print("---   Quaternions 6 DoF enabled\n");
                        if(imu.quat9_enabled) uart_print("---   Quaternions 9 DoF enabled\n");
                        if(imu.frequency != 0)
                        {
                            uart_print("---  Sensor frequency:  ");
                            char str[5];
                            sprintf(str, "%d Hz\n", imu.frequency);
                            NRF_LOG_INFO("string: %s", str);
                            uart_print(str);
                        }
                        uart_print("------------------------------------------\n");
                        break;

                case CMD_GYRO:
                        NRF_LOG_INFO("CMD_GYRO received");
                        // NRF_LOG_FLUSH();
                        imu.gyro_enabled = 1;
                        // state = CMD_FREQ;
                    break;

                case CMD_ACCEL:
                        NRF_LOG_INFO("CMD_ACCEL received");
                        // NRF_LOG_FLUSH();
                        imu.accel_enabled = 1;
                        // state = CMD_FREQ;
                    break;

                case CMD_MAG:
                        NRF_LOG_INFO("CMD_MAG received");
                        // NRF_LOG_FLUSH();
                        imu.mag_enabled = 1;
                        // state = CMD_FREQ;
                    break;

                case CMD_QUAT:
                        NRF_LOG_INFO("CMD_QUAT received");
                        // NRF_LOG_FLUSH();

                        uint8_t byte[1];
                        err_code =  app_fifo_get(&buffer.uart_rx_fifo, byte);

                        switch(byte[0])
                        {
                            case CMD_QUAT6:
                                    NRF_LOG_INFO("CMD_QUAT6 received");
                                    // NRF_LOG_FLUSH();
                                    imu.quat6_enabled = 1;
                                    // state = CMD_FREQ;
                                break;
                            
