jonacappelle/nRF52-DCU/main.c
                            case CMD_QUAT9:
                                    NRF_LOG_INFO("CMD_QUAT9 received");
                                    // NRF_LOG_FLUSH();
                                    imu.quat9_enabled = 1;
                                    // state = CMD_FREQ;
                                break;

                            default:
                                    NRF_LOG_INFO("Invalid character after CMD_QUAT");
                                    // NRF_LOG_FLUSH();
                                break;
                        }
                    break;

                case CMD_EULER:
                        NRF_LOG_INFO("CMD_EULER received");
                        // NRF_LOG_FLUSH();
                        imu.euler_enabled = 1;
                        // state = CMD_FREQ;
                    break;

                case CMD_RESET:
                        NRF_LOG_INFO("CMD_RESET received");

                        uart_print("------------------------------------------\n");
                        uart_print("Config reset.\n");
                        uart_print("------------------------------------------\n");

                        imu.gyro_enabled = 0;
                        imu.accel_enabled = 0;
                        imu.mag_enabled = 0;
                        imu.quat6_enabled = 0;
                        imu.quat9_enabled = 0;
                        imu.euler_enabled = 0;
                        imu.frequency = 0;
                    break;

                
                case CMD_FREQ:
                {
                        NRF_LOG_INFO("CMD_FREQ");
                        // NRF_LOG_FLUSH();

                        uint32_t cmd_freq_len = 3;

                        uint8_t p_byte1[3];
                        err_code = app_fifo_read(&buffer.uart_rx_fifo, p_byte1, &cmd_freq_len);

                        // Get frequency components
                        if(err_code == NRF_SUCCESS)
                        {
                            // NRF_LOG_INFO("success");
                            // NRF_LOG_FLUSH();
                            uint8_t cmd = uart_rx_to_cmd(p_byte1, CMD_FREQ_LEN);
                            NRF_LOG_INFO("Frequency received: %d", cmd);
                            NRF_LOG_FLUSH();

                            switch(cmd)
                            {
                                // NRF_LOG_INFO("in switch statement");
                                // NRF_LOG_FLUSH();

                                case CMD_FREQ_50:
                                        NRF_LOG_INFO("CMD_FREQ_50 received");
                                        imu.frequency = 50;
                                        // NRF_LOG_FLUSH();
                                    break;
                                
                                case CMD_FREQ_100:
                                        NRF_LOG_INFO("CMD_FREQ_100 received");
                                        imu.frequency = 100;
                                        // NRF_LOG_FLUSH();
                                    break;

                                case CMD_FREQ_225:
                                        NRF_LOG_INFO("CMD_FREQ_225 received");
                                        imu.frequency = 225;
                                        // NRF_LOG_FLUSH();
                                    break;

                                default:
                                        NRF_LOG_INFO("Invalid character CMD_FREQ");
                                        uart_print("Invalid frequency selected!\n");
                                        // NRF_LOG_FLUSH();
                                    break;
                            }
                        }
                        else
                        {
                            NRF_LOG_INFO("err_code: %d", err_code);
                            NRF_LOG_FLUSH();
                        }
                }
                break;

                case CMD_SEND:

                        // Send config
                        NRF_LOG_INFO("CMD_CONFIG_SEND received");

                        ble_tes_config_t config;
                        config.gyro_enabled = imu.gyro_enabled;
                        config.accel_enabled = imu.accel_enabled;
                        config.mag_enabled = imu.mag_enabled;
                        config.euler_enabled = imu.euler_enabled;
                        config.quat6_enabled = imu.quat6_enabled;
                        config.quat9_enabled = imu.quat9_enabled;
                        config.motion_freq_hz = imu.frequency;
                        config.wom_enabled = 1;

                        err_code =  ble_tes_config_set(&m_thingy_tes_c[0], &config);
                        if(err_code != NRF_SUCCESS)
                        {
                            NRF_LOG_INFO("ble_tes_config_set error %d", err_code);
                        }
                        else
                        {
                            uart_print("------------------------------------------\n");
                            uart_print("Configuration send to peripherals.\n");
                            uart_print("------------------------------------------\n");
                        }  
                    break;

                default:
                    NRF_LOG_INFO("DEFAULT");
                    NRF_LOG_FLUSH();
                    uart_print("------------------------------------------\n");
                    uart_print("Invalid command.\n");
                    uart_print("------------------------------------------\n");
                    break;
            }
    }

    nrf_gpio_pin_set(12);
    nrf_delay_ms(500);
    nrf_gpio_pin_clear(12);

    NRF_LOG_INFO("UART CMD detection ended");
    NRF_LOG_FLUSH();
}


void imu_uart_sceduled(void *p_event_data, uint16_t event_size)
{
    while (imu.evt_scheduled > 0)
    {
        uint32_t err_code;

        bool read_success = false;

