jonacappelle/nRF52-DCU/main.c
        // NRF_LOG_INFO("App scheduler execute: %d", imu.evt_scheduled);

        char string[26];

        float quat[4];
        uint32_t quat_len = sizeof(quat);

        if (app_fifo_read(&buffer.received_data_fifo, quat, &quat_len) == NRF_SUCCESS)
        {
            // NRF_LOG_INFO("Read QUAT6");
            // NRF_LOG_INFO("%d %d %d %d", 1000*quat[0], 1000*quat[1], 1000*quat[2], 1000*quat[3]);
            sprintf(string, "w%.3fwa%.3fab%.3fbc%.3fc\n", quat[0], quat[1], quat[2], quat[3]);
            // NRF_LOG_INFO("%s", string);

            read_success = true;
            imu.evt_scheduled--;
        }

                // Get data from FIFO buffer if data is correctly recognized
        if (read_success)
        {

            // NRF_LOG_INFO("read_success");
            // NRF_LOG_FLUSH();

            uint32_t string_len = 0;
            do
            {
                string_len++;
            } while (string[string_len] != '\n');
            string_len++;

            // Put the data in FIFO buffer
            err_code = app_fifo_write(&buffer.uart_dma_difo, (uint8_t *)string, &string_len);
            if (err_code == NRF_ERROR_NO_MEM)
            {
                NRF_LOG_INFO("UART FIFO BUFFER FULL!");
            }

            if (err_code == NRF_SUCCESS)
            {
                //								NRF_LOG_INFO("Data in FIFO");
                // The new byte has been added to FIFO. It will be picked up from there
                // (in 'uart_event_handler') when all preceding bytes are transmitted.
                // But if UART is not transmitting anything at the moment, we must start
                // a new transmission here.
                if (!nrf_drv_uart_tx_in_progress(&imu.uart))
                {
                    //										NRF_LOG_INFO("TX not in progress");
                    // This operation should be almost always successful, since we've
                    // just added a byte to FIFO, but if some bigger delay occurred
                    // (some heavy interrupt handler routine has been executed) since
                    // that time, FIFO might be empty already.
                    if (app_fifo_read(&buffer.uart_dma_difo, buffer.uart_dma_tx_buff, &string_len) == NRF_SUCCESS)
                    {
                        //												NRF_LOG_INFO("FIFO read");
                        do
                        {
                            err_code = nrf_drv_uart_tx(&imu.uart, buffer.uart_dma_tx_buff, (uint8_t)string_len);
                            if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                            {
                                NRF_LOG_ERROR("nrf_drv_uart_tx failed");
                                APP_ERROR_CHECK(err_code);
                            }
                        } while (err_code == NRF_ERROR_BUSY);
                        //												NRF_LOG_INFO("UART TX OK");
                    }
                }
            }

        }
    }
}





// Event handler DIY
void data_evt_sceduled(void *p_event_data, uint16_t event_size)
{
    nrf_gpio_pin_set(22);
    uint32_t err_code;

    while (imu.evt_scheduled > 0)
    {
        NRF_LOG_INFO("App scheduler execute: %d", imu.evt_scheduled);
        NRF_LOG_FLUSH();

        uint32_t classification_byte_len = 1;
        uint8_t classification_byte[classification_byte_len];

        bool read_success = false;
        uint32_t temp_len;
        float quat[4];
        float other[3];
        char string_send[200];

        // Get 1 byte from buffer to determine which sort of data we are dealing with
        if (app_fifo_read(&buffer.received_data_fifo, classification_byte, &classification_byte_len) == NRF_SUCCESS)
        {
            switch (classification_byte[0])
            {
            case ENABLE_QUAT6:
                // Get 4 floats
                temp_len = 4 * sizeof(float);
                // NRF_LOG_INFO("temp_len: %d", temp_len);
                if (app_fifo_read(&buffer.received_data_fifo, (uint8_t *)quat, &temp_len) == NRF_SUCCESS)
                {
                    NRF_LOG_INFO("Read QUAT6");
                    NRF_LOG_INFO("%d %d %d %d", 1000*quat[0], 1000*quat[1], 1000*quat[2], 1000*quat[3]);
                    read_success = true;
                    sprintf(string_send, "w%.2fwa%.2fab%.2fbc%.2fc\n", quat[0], quat[1], quat[2], quat[3]);
                    NRF_LOG_INFO("%s", string_send);
                }
                break;
            case ENABLE_QUAT9:
                // Get 4 floats
                temp_len = 4 * sizeof(float);
                // NRF_LOG_INFO("temp_len: %d", temp_len);
                if (app_fifo_read(&buffer.received_data_fifo, (uint8_t *)quat, &temp_len) == NRF_SUCCESS)
                {
                    NRF_LOG_INFO("Read QUAT9");
                    NRF_LOG_INFO("%d %d %d %d", 1000*quat[0], 1000*quat[1], 1000*quat[2], 1000*quat[3]);
                    read_success = true;
                    sprintf(string_send, "w%fwa%fab%fbc%fc\n", quat[0], quat[1], quat[2], quat[3]);
                    NRF_LOG_INFO("%s", string_send);
                }
                break;
            case ENABLE_EULER:
                // Get 3 floats
                temp_len = 3 * sizeof(float);
                if (app_fifo_read(&buffer.received_data_fifo, (uint8_t *)other, &temp_len) == NRF_SUCCESS)
                {
                    NRF_LOG_INFO("Read EULER");
                    read_success = true;
                    // Convert to string
                    sprintf(string_send, "Euler: x: %f	y: %f	z: %f\n", other[0], other[1], other[2]);
                }
                break;
            case ENABLE_GYRO:
                // Get 3 floats
                temp_len = 3 * sizeof(float);
                if (app_fifo_read(&buffer.received_data_fifo, (uint8_t *)other, &temp_len) == NRF_SUCCESS)
                {
                    NRF_LOG_INFO("Read GYRO");
                    read_success = true;
                    // Convert to string
                    sprintf(string_send, "Gyro: x: %.2f	y: %.2f	z: %.2f\n", other[0], other[1], other[2]);
                }
                break;
            case ENABLE_ACCEL:
                // Get 3 floats
                temp_len = 3 * sizeof(float);
                if (app_fifo_read(&buffer.received_data_fifo, (uint8_t *)other, &temp_len) == NRF_SUCCESS)
                {
                    NRF_LOG_INFO("Read ACC");
                    read_success = true;
                    // Convert to string
                    sprintf(string_send, "Acc: x: %.2f	y: %.2f	z: %.2f\n", other[0], other[1], other[2]);
                }
                break;
            case ENABLE_MAG:
                // Get 3 floats
                temp_len = 3 * sizeof(float);
                if (app_fifo_read(&buffer.received_data_fifo, (uint8_t *)other, &temp_len) == NRF_SUCCESS)
                {
                    NRF_LOG_INFO("Read MAG");
                    read_success = true;
                    // Convert to string
                    sprintf(string_send, "Mag: x: %f	y: %f	z: %f\n", other[0], other[1], other[2]);
                }
                break;
            default:
                // in case of error
                NRF_LOG_INFO("Error detecting classification_byte: %X", classification_byte[0]);
                break;
            }
        }

        // Get data from FIFO buffer if data is correctly recognized
        if (read_success)
        {

            // NRF_LOG_INFO("read_success");
            // NRF_LOG_FLUSH();

            uint32_t string_len = 0;
            do
            {
                string_len++;
            } while (string_send[string_len] != '\n');
            string_len++;

            // Put the data in FIFO buffer
            err_code = app_fifo_write(&buffer.uart_dma_difo, (uint8_t *)string_send, &string_len);
            if (err_code == NRF_ERROR_NO_MEM)
            {
                NRF_LOG_INFO("UART FIFO BUFFER FULL!");
            }

            if (err_code == NRF_SUCCESS)
            {
                //								NRF_LOG_INFO("Data in FIFO");
                // The new byte has been added to FIFO. It will be picked up from there
                // (in 'uart_event_handler') when all preceding bytes are transmitted.
                // But if UART is not transmitting anything at the moment, we must start
                // a new transmission here.
                if (!nrf_drv_uart_tx_in_progress(&imu.uart))
                {
                    //										NRF_LOG_INFO("TX not in progress");
                    // This operation should be almost always successful, since we've
                    // just added a byte to FIFO, but if some bigger delay occurred
                    // (some heavy interrupt handler routine has been executed) since
                    // that time, FIFO might be empty already.
                    if (app_fifo_read(&buffer.uart_dma_difo, buffer.uart_dma_tx_buff, &string_len) == NRF_SUCCESS)
                    {
                        //												NRF_LOG_INFO("FIFO read");
                        do
                        {
                            err_code = nrf_drv_uart_tx(&imu.uart, buffer.uart_dma_tx_buff, (uint8_t)string_len);
                            if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                            {
                                NRF_LOG_ERROR("nrf_drv_uart_tx failed");
                                APP_ERROR_CHECK(err_code);
                            }
                        } while (err_code == NRF_ERROR_BUSY);
                        //												NRF_LOG_INFO("UART TX OK");
                    }
                }
            }
            imu.evt_scheduled--; // Needs to be here: problem: can skip some malformed packets - otherwise the app_scheduler will continue to execute and block the cpu
        }
        
