jonacappelle/nRF52-DCU/main.c
// Put every received byte in a FIFO buffer
static void ble_nus_data_received_uart_print(uint8_t *p_data, uint16_t data_len)
{
    nrf_gpio_pin_set(18);

    NRF_LOG_INFO("%X", p_data[0]);

    ret_code_t err_code;

    uint8_t temp[data_len / sizeof(uint8_t)];

    // Copy data to quaternion varaiable
    memcpy(temp, p_data, data_len);

    uint32_t temp_len = sizeof(temp);

    // Put the received data in FIFO buffer
    err_code = app_fifo_write(&buffer.received_data_fifo, temp, &temp_len);
    if (err_code == NRF_ERROR_NO_MEM)
    {
        NRF_LOG_INFO("RECEIVED DATA FIFO BUFFER FULL!");
    }
    if (err_code == NRF_SUCCESS)
    {
        // Signal to event handler to execute sprintf + start UART transmission
        // If there are already events in the queue
        if (imu.evt_scheduled > 0)
        {
            imu.evt_scheduled++;
        }
        // If there are not yet any events in the queue, schedule event. In gpiote_evt_sceduled all callbacks are called
        else
        {
            imu.evt_scheduled++;
            err_code = app_sched_event_put(0, 0, data_evt_sceduled);
            APP_ERROR_CHECK(err_code);
        }
    }

    nrf_gpio_pin_clear(18);
}

/**@brief   Function for handling app_uart events.
 *
 * @details This function receives a single character from the app_uart module and appends it to
 *          a string. The string is sent over BLE when the last character received is a
 *          'new line' '\n' (hex 0x0A) or if the string reaches the maximum data length.
 */
void uart_event_handle(app_uart_evt_t *p_event)
{
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    static uint16_t index = 0;
    uint32_t ret_val;

    switch (p_event->evt_type)
    {
    /**@snippet [Handling data from UART] */
    case APP_UART_DATA_READY:
        //            UNUSED_VARIABLE(app_uart_get(&data_array[index]));
        //            index++;

        //            if ((data_array[index - 1] == '\n') ||
        //                (data_array[index - 1] == '\r') ||
        //                (index >= (m_ble_nus_max_data_len)))
        //            {
        //                NRF_LOG_DEBUG("Ready to send data over BLE NUS");
        //                NRF_LOG_HEXDUMP_DEBUG(data_array, index);

        //
        //							/* CHANGES
        //                do
        //                {
        //                    ret_val = ble_nus_c_string_send(&m_ble_nus_c, data_array, index);
        //                    if ( (ret_val != NRF_ERROR_INVALID_STATE) && (ret_val != NRF_ERROR_RESOURCES) )
        //                    {
        //                        APP_ERROR_CHECK(ret_val);
        //                    }
        //                } while (ret_val == NRF_ERROR_RESOURCES);
        //							END CHANGES	*/
        //
        //							for(int c = 0; c < NRF_SDH_BLE_CENTRAL_LINK_COUNT; c++)
        //                {
        //                    do
        //                    {
        //                        ret_val = ble_nus_c_string_send(&m_ble_nus_c[c], data_array, index);
        //                        if ( (ret_val != NRF_ERROR_INVALID_STATE) && (ret_val != NRF_ERROR_RESOURCES) )
        //                        {
        //                            APP_ERROR_CHECK(ret_val);
        //                        }
        //                    } while (ret_val == NRF_ERROR_RESOURCES);
        //                }
        //							/* END CHANGES */
        //
        //                index = 0;
        //            }
        break;

    /**@snippet [Handling data from UART] */
    case APP_UART_COMMUNICATION_ERROR:
        NRF_LOG_ERROR("Communication error occurred while handling UART.");
        NRF_LOG_INFO("Communication error occurred while handling UART.");
        NRF_LOG_FLUSH();
        APP_ERROR_HANDLER(p_event->data.error_communication);
        break;

    case APP_UART_FIFO_ERROR:
        NRF_LOG_ERROR("Error occurred in FIFO module used by UART.");
        APP_ERROR_HANDLER(p_event->data.error_code);
        break;

    default:
        break;
    }
}

/**@brief Callback handling Nordic UART Service (NUS) client events.
 *
 * @details This function is called to notify the application of NUS client events.
 *
 * @param[in]   p_ble_nus_c   NUS client handle. This identifies the NUS client.
 * @param[in]   p_ble_nus_evt Pointer to the NUS client event.
 */

/**@snippet [Handling events from the ble_nus_c module] */
static void ble_nus_c_evt_handler(ble_nus_c_t *p_ble_nus_c, ble_nus_c_evt_t const *p_ble_nus_evt)
{
    ret_code_t err_code;

    NRF_LOG_INFO("ble_nus_c_evt_handler");

    switch (p_ble_nus_evt->evt_type)
    {
    case BLE_NUS_C_EVT_DISCOVERY_COMPLETE:
        NRF_LOG_INFO("Discovery complete.");
        err_code = ble_nus_c_handles_assign(p_ble_nus_c, p_ble_nus_evt->conn_handle, &p_ble_nus_evt->handles);
        APP_ERROR_CHECK(err_code);

        err_code = ble_nus_c_tx_notif_enable(p_ble_nus_c);
        APP_ERROR_CHECK(err_code);
        NRF_LOG_INFO("Connected to device with Nordic UART Service.");
        break;

    case BLE_NUS_C_EVT_NUS_TX_EVT:
        //            ble_nus_chars_received_uart_print(p_ble_nus_evt->p_data, p_ble_nus_evt->data_len);
        ble_nus_data_received_uart_print(p_ble_nus_evt->p_data, p_ble_nus_evt->data_len);
        // NRF_LOG_INFO("Character received");
        // NRF_LOG_INFO("Receive counter:	%d", imu.received_packet_counter);
        imu.received_packet_counter++;
        break;

    case BLE_NUS_C_EVT_DISCONNECTED:
        NRF_LOG_INFO("Disconnected.");
        scan_start();
        break;
    }
}
/**@snippet [Handling events from the ble_nus_c module] */

/**
 * @brief Function for handling shutdown events.
 *
 * @param[in]   event       Shutdown type.
 */
static bool shutdown_handler(nrf_pwr_mgmt_evt_t event)
{
    ret_code_t err_code;

    err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    switch (event)
    {
    case NRF_PWR_MGMT_EVT_PREPARE_WAKEUP:
        // Prepare wakeup buttons.
        err_code = bsp_btn_ble_sleep_mode_prepare();
        APP_ERROR_CHECK(err_code);
        break;

    default:
        break;
    }

