jonacappelle/nRF52-DCU/main.c
    init.evt_handler = ble_nus_c_evt_handler;
    init.error_handler = nus_error_handler;
    init.p_gatt_queue = &m_ble_gatt_queue;

    /* CHANGES
    err_code = ble_nus_c_init(&m_ble_nus_c, &init);
    APP_ERROR_CHECK(err_code);
	END CHANGES */
    for (int c = 0; c < NRF_SDH_BLE_CENTRAL_LINK_COUNT; c++)
    {
        err_code = ble_nus_c_init(&m_ble_nus_c[c], &init);
        APP_ERROR_CHECK(err_code);
    }
    /* END CHANGES */
}

/**@brief Function for initializing buttons and leds. */
static void buttons_leds_init(void)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    // err_code = bsp_init(BSP_INIT_LEDS, bsp_event_handler);

    // TimeSync begin
    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    // TimeSync end

    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the timer. */
static void timer_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the nrf log module. */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}

/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}

/** @brief Function for initializing the database discovery module. */
static void db_discovery_init(void)
{
    ble_db_discovery_init_t db_init;

    memset(&db_init, 0, sizeof(ble_db_discovery_init_t));

    db_init.evt_handler = db_disc_handler;
    db_init.p_gatt_queue = &m_ble_gatt_queue;

    ret_code_t err_code = ble_db_discovery_init(&db_init);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the idle state (main loop).
 *
 * @details Handles any pending log operations, then sleeps until the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/////////////// LED BUTTON BLINK /////////////////////
void in_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    nrf_drv_gpiote_out_toggle(PIN_OUT);

    /* CHANGES */

    NRF_LOG_INFO("BUTTON PRESS");

    /* END CHANGES */
}


char const *phy_str(ble_gap_phys_t phys)
{
    static char const *str[] =
        {
            "1 Mbps",
            "2 Mbps",
            "Coded",
            "Unknown"};

    switch (phys.tx_phys)
    {
    case BLE_GAP_PHY_1MBPS:
        return str[0];

    case BLE_GAP_PHY_2MBPS:
    case BLE_GAP_PHY_2MBPS | BLE_GAP_PHY_1MBPS:
    case BLE_GAP_PHY_2MBPS | BLE_GAP_PHY_1MBPS | BLE_GAP_PHY_CODED:
        return str[1];

    case BLE_GAP_PHY_CODED:
        return str[2];

    default:
        return str[3];
    }
}


void conn_evt_len_ext_set(void)
{
    ret_code_t err_code;
    ble_opt_t opt;

    memset(&opt, 0x00, sizeof(opt));
    opt.common_opt.conn_evt_ext.enable = 1;

    err_code = sd_ble_opt_set(BLE_COMMON_OPT_CONN_EVT_EXT, &opt);
    APP_ERROR_CHECK(err_code);
}

static uint8_t rx_buffer[1];

static void usr_uarte_evt_handler(nrf_drv_uart_event_t *p_event, void *p_context)
{
    uint32_t err_code;

    switch (p_event->type)
    {
    case NRF_DRV_UART_EVT_TX_DONE: ///< Requested TX transfer completed.
    {
        uint32_t index = 255;
        // Get next bytes from FIFO.
        if (app_fifo_read(&buffer.uart_dma_difo, buffer.uart_dma_tx_buff, &index) == NRF_SUCCESS)
        {
            nrf_drv_uart_tx(&imu.uart, buffer.uart_dma_tx_buff, (uint8_t)index);
            //								NRF_LOG_INFO("index evt %d", index);
            //								NRF_LOG_INFO("Send next byte from evt handler");
        }
        else
        {
                // Last byte from FIFO transmitted, notify the application.
                // app_uart_event.evt_type = APP_UART_TX_EMPTY;
                // m_event_handler(&app_uart_event);
                // NRF_LOG_INFO("UART TX EMPTY");
        }
        // NRF_LOG_INFO("UART TX done");
        break;
    }
    case NRF_DRV_UART_EVT_RX_DONE: ///< Requested RX transfer completed.
    {

        nrf_drv_uart_rx(&imu.uart, rx_buffer, 1);


        NRF_LOG_INFO("NRF_DRV_UART_EVT_RX_DONE");

        // uint8_t received_data_len = p_event->data.rxtx.bytes;
        // char received_data[received_data_len];
        // memcpy(received_data, p_event->data.rxtx.p_data, received_data_len);

        // NRF_LOG_INFO("len: %d", received_data_len);
        
        // NRF_LOG_INFO("%d %d", received_data[0], received_data[1], received_data[2]);

        err_code = app_fifo_put(&buffer.uart_rx_fifo, p_event->data.rxtx.p_data[0]);
        if(err_code != NRF_SUCCESS)
        {
            NRF_LOG_INFO("app_fifo_put in NRF_DRV_UART_EVT_RX_DONE failed");
        }

        if(p_event->data.rxtx.p_data[0] == CMD_CR)
        {
            NRF_LOG_INFO("app_sched_event_put uart rx");
            err_code = app_sched_event_put(0, 0, uart_rx_scheduled);
            APP_ERROR_CHECK(err_code);
        }
    }
        break;
    case NRF_DRV_UART_EVT_ERROR: ///< Error reported by UART peripheral.
        NRF_LOG_INFO("Error in NRF_DRV_UART_EVT_ERROR");
        break;
    default:
        break;
    }
}

void uart_dma_init()
{
    ret_code_t err_code;

    nrf_drv_uart_config_t const uart_config_params = {
        .pseltxd = TX_PIN_NUMBER,
        .pselrxd = RX_PIN_NUMBER,
        .pselcts = CTS_PIN_NUMBER,
        .pselrts = RTS_PIN_NUMBER,
        .p_context = NULL,
        .hwfc = (nrf_uart_hwfc_t)UART_DEFAULT_CONFIG_HWFC,
        .parity = (nrf_uart_parity_t)UART_DEFAULT_CONFIG_PARITY,
        .baudrate = (nrf_uart_baudrate_t)UART_BAUDRATE_BAUDRATE_Baud1M,
        .interrupt_priority = UART_DEFAULT_CONFIG_IRQ_PRIORITY, //NRF_DRV_UART_DEFAULT_CONFIG_USE_EASY_DMA                                 \ // Yes, use easyDMA!
    };

    err_code = nrf_drv_uart_init(&imu.uart, &uart_config_params, usr_uarte_evt_handler);

    APP_ERROR_CHECK(err_code);

    nrf_drv_uart_rx_enable(&imu.uart);

    nrf_drv_uart_rx(&imu.uart, rx_buffer, 1);
}



void set_imu_packet_length()
{
    imu.packet_length = 0;

    if (imu.gyro_enabled)
    {
        imu.packet_length += 3 * sizeof(float);
    }
    if (imu.accel_enabled)
    {
        imu.packet_length += 3 * sizeof(float);
    }
    if (imu.mag_enabled)
    {
        imu.packet_length += 3 * sizeof(float);
    }
    if (imu.quat6_enabled)
    {
        imu.packet_length += 4 * sizeof(float);
    }
    if (imu.quat9_enabled)
    {
        imu.packet_length += 4 * sizeof(float);
    }
    if (imu.euler_enabled)
    {
        imu.packet_length += 3 * sizeof(float);
    }

    NRF_LOG_INFO("Packet Len set to: %d", imu.packet_length);
}





