jonacappelle/nRF52-DCU/main.c
void thingy_tes_c_evt_handler(ble_thingy_tes_c_t * p_ble_tes_c, ble_tes_c_evt_t * p_evt)
{

nrf_gpio_pin_set(11);

    switch (p_evt->evt_type)
    {
        ret_code_t err_code;

        case BLE_THINGY_TES_C_EVT_DISCOVERY_COMPLETE:
        {
            err_code = ble_tes_c_handles_assign(&m_thingy_tes_c[p_evt->conn_handle],
                                                p_evt->conn_handle,
                                                &p_evt->params.peer_db);
            NRF_LOG_INFO("Thingy Environment service discovered on conn_handle 0x%x.", p_evt->conn_handle);
            
            // Enable notifications - in peripheral this equates to turning on the sensors
            // err_code = ble_tes_c_quaternion_notif_enable(&m_thingy_tes_c[p_evt->conn_handle]);
            // APP_ERROR_CHECK(err_code);
            // err_code = ble_tes_c_adc_notif_enable(&m_thingy_tes_c[p_evt->conn_handle]);
            // APP_ERROR_CHECK(err_code);
            // err_code = ble_tes_c_euler_notif_enable(&m_thingy_tes_c[p_evt->conn_handle]);
            // APP_ERROR_CHECK(err_code);
            // err_code = ble_tes_c_raw_notif_enable(&m_thingy_tes_c[p_evt->conn_handle]);
            // APP_ERROR_CHECK(err_code);

        }
        break;

        case BLE_TMS_EVT_QUAT:
        {
            imu.received_packet_counter++;
            // NRF_LOG_INFO("%d", imu.received_packet_counter);

            float quat_buff[4];
            uint32_t quat_buff_len = sizeof(quat_buff);

            #define FIXED_POINT_FRACTIONAL_BITS_QUAT        30

            quat_buff[0] = ((float)p_evt->params.value.quat_data.w / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_QUAT));
            quat_buff[1] = ((float)p_evt->params.value.quat_data.x / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_QUAT));
            quat_buff[2] = ((float)p_evt->params.value.quat_data.y / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_QUAT));
            quat_buff[3] = ((float)p_evt->params.value.quat_data.z / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_QUAT));
            
            
            NRF_LOG_INFO("quat: %d %d  %d  %d", (int)(quat_buff[0]*1000), (int)(quat_buff[1]*1000), (int)(quat_buff[2]*1000), (int)(quat_buff[3]*1000));

            // Put the received data in FIFO buffer
            err_code = app_fifo_write(&buffer.received_data_fifo, quat_buff, &quat_buff_len);
            // NRF_LOG_INFO("app_fifo_write: %d", err_code);
            // NRF_LOG_FLUSH();

            if (err_code == NRF_ERROR_NO_MEM)
            {
                NRF_LOG_INFO("RECEIVED DATA FIFO BUFFER FULL!");
            }
            if (err_code == NRF_SUCCESS)
            {
                // Signal to event handler to execute sprintf + start UART transmission
                // If there are already events in the queue
                if (imu.evt_scheduled > 0)
                {
                    imu.evt_scheduled++;
                }
                // If there are not yet any events in the queue, schedule event. In gpiote_evt_sceduled all callbacks are called
                else
                {
                    imu.evt_scheduled++;
                    err_code = app_sched_event_put(0, 0, imu_uart_sceduled);
                    APP_ERROR_CHECK(err_code);
                }
            }
        }
        break;
        
        case BLE_TMS_EVT_EULER:
        {
            float euler_buff[3];
            uint32_t euler_buff_len = sizeof(euler_buff);

            #define FIXED_POINT_FRACTIONAL_BITS_EULER       16

            euler_buff[0] = ((float)p_evt->params.value.euler_data.yaw / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_EULER));
            euler_buff[1] = ((float)p_evt->params.value.euler_data.pitch / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_EULER));
            euler_buff[2] = ((float)p_evt->params.value.euler_data.roll / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_EULER));            
            
            NRF_LOG_INFO("euler: %d %d  %d", (int)euler_buff[0], (int)euler_buff[1], (int)euler_buff[2]);
        }
        break;

        case BLE_TMS_EVT_RAW:
        {
            #define RAW_Q_FORMAT_GYR_COMMA_BITS 5    // Number of bits used for comma part of raw data.
            #define RAW_Q_FORMAT_ACC_COMMA_BITS 10     // Number of bits used for comma part of raw data.
            #define RAW_Q_FORMAT_CMP_COMMA_BITS 4    // Number of bits used for comma part of raw data.

            float gyro[3];
            float accel[3];
            float mag[3];

            gyro[0] = ((float)p_evt->params.value.raw_data.gyro.x / (float)(1 << RAW_Q_FORMAT_GYR_COMMA_BITS));
            gyro[1] = ((float)p_evt->params.value.raw_data.gyro.y / (float)(1 << RAW_Q_FORMAT_GYR_COMMA_BITS));
            gyro[2] = ((float)p_evt->params.value.raw_data.gyro.z / (float)(1 << RAW_Q_FORMAT_GYR_COMMA_BITS));   
            
            accel[0] = ((float)p_evt->params.value.raw_data.accel.x / (float)(1 << RAW_Q_FORMAT_ACC_COMMA_BITS));
            accel[1] = ((float)p_evt->params.value.raw_data.accel.y / (float)(1 << RAW_Q_FORMAT_ACC_COMMA_BITS));
            accel[2] = ((float)p_evt->params.value.raw_data.accel.z / (float)(1 << RAW_Q_FORMAT_ACC_COMMA_BITS));   

            mag[0] = ((float)p_evt->params.value.raw_data.compass.x / (float)(1 << RAW_Q_FORMAT_CMP_COMMA_BITS));
            mag[1] = ((float)p_evt->params.value.raw_data.compass.y / (float)(1 << RAW_Q_FORMAT_CMP_COMMA_BITS));
            mag[2] = ((float)p_evt->params.value.raw_data.compass.z / (float)(1 << RAW_Q_FORMAT_CMP_COMMA_BITS));   


            NRF_LOG_INFO("raw:  gyro: %d %d  %d", (int)(gyro[0]*1000), (int)(gyro[1]*1000), (int)(gyro[2]*1000));
            NRF_LOG_INFO("raw:  accel: %d   %d  %d", (int)(accel[0]*1000), (int)(accel[1]*1000), (int)(accel[2]*1000));
            NRF_LOG_INFO("raw:  mag: %d %d  %d", (int)(mag[0]*1000), (int)(mag[1]*1000), (int)(mag[2]*1000));

        }
        break;

        case BLE_TMS_EVT_ADC:
        {
            NRF_LOG_INFO("ADC data: %d", p_evt->params.value.adc_data.raw[1]);
        }
        break;

        default:
        {
            NRF_LOG_INFO("thingy_tes_c_evt_handler DEFAULT: %d", (p_evt->evt_type));
        }
        break;
    }

    nrf_gpio_pin_clear(11);
}

static void thingy_tes_c_init(void)
{
    ret_code_t       err_code;

