jonacappelle/nRF52-DCU/main.c
    ble_thingy_tes_c_init_t thingy_tes_c_init_obj;
    thingy_tes_c_init_obj.evt_handler =  thingy_tes_c_evt_handler;

    for (uint32_t i = 0; i < NRF_SDH_BLE_CENTRAL_LINK_COUNT; i++)
    {
        err_code = ble_thingy_tes_c_init(&m_thingy_tes_c[i], &thingy_tes_c_init_obj);
        APP_ERROR_CHECK(err_code);
    }
}


int main(void)
{
    uint32_t err_code;

    // Initialize.
    log_init();
    timer_init();
    //    uart_init();

    uart_dma_init();

    // Create a buffer for the FIFO
    uint16_t uart_dma_buffer_size = 2048;
    uint8_t uart_dma_buffer[uart_dma_buffer_size];

    // // Create a buffer for the FIFO
    // uint16_t received_data_buffer_size = 4096;
    // uint8_t received_data_buffer[received_data_buffer_size];

    
    // Initialize FIFO structure for use in UART DMA
    err_code = app_fifo_init(&buffer.uart_dma_difo, uart_dma_buffer, (uint16_t)sizeof(uart_dma_buffer));
    APP_ERROR_CHECK(err_code);

    // // Initialize FIFO structure for collecting received data
    // err_code = app_fifo_init(&buffer.received_data_fifo, received_data_buffer, (uint16_t)sizeof(received_data_buffer));
    // APP_ERROR_CHECK(err_code);

    uint16_t uart_rx_buff_size = 256;
    uint8_t uart_rx_buff[uart_rx_buff_size];

    err_code = app_fifo_init(&buffer.uart_rx_fifo, uart_rx_buff, (uint16_t)sizeof(uart_rx_buff));
    APP_ERROR_CHECK(err_code);

    // Application scheduler (soft interrupt like)
    APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);

    buttons_leds_init();
    db_discovery_init();
    power_management_init();
    ble_stack_init();
    // conn_evt_len_ext_set(); // added for faster speed

    gatt_init();
    nus_c_init();


    thingy_tes_c_init();

    /* CHANGES ADDED */
    ble_conn_state_init();
    /* END ADDED CHANGES */

    scan_init();

    // BLUE LED as output
    //nrf_gpio_cfg_output(7);

    // Start execution.
    // printf("BLE DCU central started.\r\n");
    NRF_LOG_INFO("BLE DCU central started.");
    scan_start();

    // TimeSync
    // Start TimeSync AFTER scan_start()
    // This is a temporary fix for a known bug where connection is constantly closed with error code 0x3E
    sync_timer_init();

    /* CHANGES */
    // TIMER DIY INIT
    // timer_diy_init();
    /* END CHANGES */

    // Check time needed to process data
    nrf_gpio_cfg_output(18);
    // Check active time of CPU
    nrf_gpio_cfg_output(19);
    // Check time of NRF_LOG_FLUSH
    nrf_gpio_cfg_output(20);
    // Check UART transmission
    nrf_gpio_cfg_output(22);
    // Sprintf timing
    nrf_gpio_cfg_output(10);

    nrf_gpio_cfg_output(11);
nrf_gpio_cfg_output(12);





    NRF_LOG_DEBUG("DEBUG ACTIVE");



    // Enter main loop.
    for (;;)
    {
        // App scheduler: handle event in buffer
        nrf_gpio_pin_set(19);
        app_sched_execute();
        nrf_gpio_pin_clear(19);

        nrf_gpio_pin_set(20);
        NRF_LOG_FLUSH();
        nrf_gpio_pin_clear(20);

        
        idle_state_handle();

        // Toggle pin to check CPU activity
        nrf_gpio_pin_toggle(17);
    }
}
